7767517
201 226
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 844 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             LeakyRelu_1              1 1 844 424 0=1.000000e-01
Pooling          MaxPool_2                1 1 424 425 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 425 425_splitncnn_0 425_splitncnn_1
ConvolutionDepthWise Conv_3                   1 1 425_splitncnn_1 847 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_4                   1 1 847 850 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1392
ReLU             LeakyRelu_5              1 1 850 430 0=1.000000e-01
Convolution      Conv_6                   1 1 425_splitncnn_0 853 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1392
ReLU             LeakyRelu_7              1 1 853 433 0=1.000000e-01
ConvolutionDepthWise Conv_8                   1 1 433 856 0=58 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_9                   1 1 856 859 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_10             1 1 859 438 0=1.000000e-01
Concat           Concat_11                2 1 430 438 439 0=0
ShuffleChannel   Reshape_16               1 1 439 444 0=2 1=0
Slice            Split_17                 1 2 444 445 446 -23300=2,58,-233 1=0
Convolution      Conv_18                  1 1 446 862 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_19             1 1 862 449 0=1.000000e-01
ConvolutionDepthWise Conv_20                  1 1 449 865 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_21                  1 1 865 868 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_22             1 1 868 454 0=1.000000e-01
Concat           Concat_23                2 1 445 454 455 0=0
ShuffleChannel   Reshape_28               1 1 455 460 0=2 1=0
Slice            Split_29                 1 2 460 461 462 -23300=2,58,-233 1=0
Convolution      Conv_30                  1 1 462 871 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_31             1 1 871 465 0=1.000000e-01
ConvolutionDepthWise Conv_32                  1 1 465 874 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_33                  1 1 874 877 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_34             1 1 877 470 0=1.000000e-01
Concat           Concat_35                2 1 461 470 471 0=0
ShuffleChannel   Reshape_40               1 1 471 476 0=2 1=0
Slice            Split_41                 1 2 476 477 478 -23300=2,58,-233 1=0
Convolution      Conv_42                  1 1 478 880 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_43             1 1 880 481 0=1.000000e-01
ConvolutionDepthWise Conv_44                  1 1 481 883 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_45                  1 1 883 886 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             LeakyRelu_46             1 1 886 486 0=1.000000e-01
Concat           Concat_47                2 1 477 486 487 0=0
ShuffleChannel   Reshape_52               1 1 487 492 0=2 1=0
Split            splitncnn_1              1 3 492 492_splitncnn_0 492_splitncnn_1 492_splitncnn_2
ConvolutionDepthWise Conv_53                  1 1 492_splitncnn_2 889 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_54                  1 1 889 892 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_55             1 1 892 497 0=1.000000e-01
Convolution      Conv_56                  1 1 492_splitncnn_1 895 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_57             1 1 895 500 0=1.000000e-01
ConvolutionDepthWise Conv_58                  1 1 500 898 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_59                  1 1 898 901 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_60             1 1 901 505 0=1.000000e-01
Concat           Concat_61                2 1 497 505 506 0=0
ShuffleChannel   Reshape_66               1 1 506 511 0=2 1=0
Slice            Split_67                 1 2 511 512 513 -23300=2,116,-233 1=0
Convolution      Conv_68                  1 1 513 904 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_69             1 1 904 516 0=1.000000e-01
ConvolutionDepthWise Conv_70                  1 1 516 907 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_71                  1 1 907 910 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_72             1 1 910 521 0=1.000000e-01
Concat           Concat_73                2 1 512 521 522 0=0
ShuffleChannel   Reshape_78               1 1 522 527 0=2 1=0
Slice            Split_79                 1 2 527 528 529 -23300=2,116,-233 1=0
Convolution      Conv_80                  1 1 529 913 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_81             1 1 913 532 0=1.000000e-01
ConvolutionDepthWise Conv_82                  1 1 532 916 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_83                  1 1 916 919 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_84             1 1 919 537 0=1.000000e-01
Concat           Concat_85                2 1 528 537 538 0=0
ShuffleChannel   Reshape_90               1 1 538 543 0=2 1=0
Slice            Split_91                 1 2 543 544 545 -23300=2,116,-233 1=0
Convolution      Conv_92                  1 1 545 922 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_93             1 1 922 548 0=1.000000e-01
ConvolutionDepthWise Conv_94                  1 1 548 925 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_95                  1 1 925 928 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_96             1 1 928 553 0=1.000000e-01
Concat           Concat_97                2 1 544 553 554 0=0
ShuffleChannel   Reshape_102              1 1 554 559 0=2 1=0
Slice            Split_103                1 2 559 560 561 -23300=2,116,-233 1=0
Convolution      Conv_104                 1 1 561 931 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_105            1 1 931 564 0=1.000000e-01
ConvolutionDepthWise Conv_106                 1 1 564 934 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_107                 1 1 934 937 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_108            1 1 937 569 0=1.000000e-01
Concat           Concat_109               2 1 560 569 570 0=0
ShuffleChannel   Reshape_114              1 1 570 575 0=2 1=0
Slice            Split_115                1 2 575 576 577 -23300=2,116,-233 1=0
Convolution      Conv_116                 1 1 577 940 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_117            1 1 940 580 0=1.000000e-01
ConvolutionDepthWise Conv_118                 1 1 580 943 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_119                 1 1 943 946 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_120            1 1 946 585 0=1.000000e-01
Concat           Concat_121               2 1 576 585 586 0=0
ShuffleChannel   Reshape_126              1 1 586 591 0=2 1=0
Slice            Split_127                1 2 591 592 593 -23300=2,116,-233 1=0
Convolution      Conv_128                 1 1 593 949 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_129            1 1 949 596 0=1.000000e-01
ConvolutionDepthWise Conv_130                 1 1 596 952 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_131                 1 1 952 955 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_132            1 1 955 601 0=1.000000e-01
Concat           Concat_133               2 1 592 601 602 0=0
ShuffleChannel   Reshape_138              1 1 602 607 0=2 1=0
Slice            Split_139                1 2 607 608 609 -23300=2,116,-233 1=0
Convolution      Conv_140                 1 1 609 958 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_141            1 1 958 612 0=1.000000e-01
ConvolutionDepthWise Conv_142                 1 1 612 961 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_143                 1 1 961 964 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             LeakyRelu_144            1 1 964 617 0=1.000000e-01
Concat           Concat_145               2 1 608 617 618 0=0
ShuffleChannel   Reshape_150              1 1 618 623 0=2 1=0
Split            splitncnn_2              1 3 623 623_splitncnn_0 623_splitncnn_1 623_splitncnn_2
ConvolutionDepthWise Conv_151                 1 1 623_splitncnn_2 967 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_152                 1 1 967 970 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_153            1 1 970 628 0=1.000000e-01
Convolution      Conv_154                 1 1 623_splitncnn_1 973 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_155            1 1 973 631 0=1.000000e-01
ConvolutionDepthWise Conv_156                 1 1 631 976 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_157                 1 1 976 979 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_158            1 1 979 636 0=1.000000e-01
Concat           Concat_159               2 1 628 636 637 0=0
ShuffleChannel   Reshape_164              1 1 637 642 0=2 1=0
Slice            Split_165                1 2 642 643 644 -23300=2,232,-233 1=0
Convolution      Conv_166                 1 1 644 982 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_167            1 1 982 647 0=1.000000e-01
ConvolutionDepthWise Conv_168                 1 1 647 985 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_169                 1 1 985 988 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_170            1 1 988 652 0=1.000000e-01
Concat           Concat_171               2 1 643 652 653 0=0
ShuffleChannel   Reshape_176              1 1 653 658 0=2 1=0
Slice            Split_177                1 2 658 659 660 -23300=2,232,-233 1=0
Convolution      Conv_178                 1 1 660 991 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_179            1 1 991 663 0=1.000000e-01
ConvolutionDepthWise Conv_180                 1 1 663 994 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_181                 1 1 994 997 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_182            1 1 997 668 0=1.000000e-01
Concat           Concat_183               2 1 659 668 669 0=0
ShuffleChannel   Reshape_188              1 1 669 674 0=2 1=0
Slice            Split_189                1 2 674 675 676 -23300=2,232,-233 1=0
Convolution      Conv_190                 1 1 676 1000 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_191            1 1 1000 679 0=1.000000e-01
ConvolutionDepthWise Conv_192                 1 1 679 1003 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_193                 1 1 1003 1006 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             LeakyRelu_194            1 1 1006 684 0=1.000000e-01
Concat           Concat_195               2 1 675 684 685 0=0
ShuffleChannel   Reshape_200              1 1 685 690 0=2 1=0
Convolution      Conv_201                 1 1 492_splitncnn_0 691 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=11136
Convolution      Conv_202                 1 1 623_splitncnn_0 692 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=22272
Convolution      Conv_203                 1 1 690 693 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=44544
Split            splitncnn_3              1 2 693 693_splitncnn_0 693_splitncnn_1
Interp           Resize_223               1 1 693_splitncnn_1 713 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_224                  2 1 692 713 714 0=0
Split            splitncnn_4              1 2 714 714_splitncnn_0 714_splitncnn_1
Interp           Resize_244               1 1 714_splitncnn_1 734 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_245                  2 1 691 734 735 0=0
Split            splitncnn_5              1 2 735 735_splitncnn_0 735_splitncnn_1
Interp           Resize_265               1 1 735_splitncnn_1 755 0=2 1=5.000000e-01 2=5.000000e-01 3=0 4=0 6=0
BinaryOp         Add_266                  2 1 714_splitncnn_0 755 756 0=0
Split            splitncnn_6              1 2 756 756_splitncnn_0 756_splitncnn_1
Interp           Resize_286               1 1 756_splitncnn_1 776 0=2 1=5.000000e-01 2=5.000000e-01 3=0 4=0 6=0
BinaryOp         Add_287                  2 1 693_splitncnn_0 776 777 0=0
ConvolutionDepthWise Conv_288                 1 1 735_splitncnn_0 1009 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_289            1 1 1009 780 0=1.000000e-01
Convolution      Conv_290                 1 1 780 1012 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_291            1 1 1012 783 0=1.000000e-01
ConvolutionDepthWise Conv_292                 1 1 783 1015 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_293            1 1 1015 786 0=1.000000e-01
Convolution      Conv_294                 1 1 786 1018 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_295            1 1 1018 789 0=1.000000e-01
Convolution      Conv_296                 1 1 789 790 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3168
Slice            Split_297                1 2 790 791 792 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_298              1 1 791 793
Reshape          Reshape_300              1 1 793 795 0=-1 1=1
Permute          Transpose_301            1 1 795 cls_pred_stride_8 0=1
Reshape          Reshape_303              1 1 792 798 0=-1 1=32
Permute          Transpose_304            1 1 798 dis_pred_stride_8 0=1
ConvolutionDepthWise Conv_305                 1 1 756_splitncnn_0 1021 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_306            1 1 1021 802 0=1.000000e-01
Convolution      Conv_307                 1 1 802 1024 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_308            1 1 1024 805 0=1.000000e-01
ConvolutionDepthWise Conv_309                 1 1 805 1027 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_310            1 1 1027 808 0=1.000000e-01
Convolution      Conv_311                 1 1 808 1030 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_312            1 1 1030 811 0=1.000000e-01
Convolution      Conv_313                 1 1 811 812 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3168
Slice            Split_314                1 2 812 813 814 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_315              1 1 813 815
Reshape          Reshape_317              1 1 815 817 0=-1 1=1
Permute          Transpose_318            1 1 817 cls_pred_stride_16 0=1
Reshape          Reshape_320              1 1 814 820 0=-1 1=32
Permute          Transpose_321            1 1 820 dis_pred_stride_16 0=1
ConvolutionDepthWise Conv_322                 1 1 777 1033 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_323            1 1 1033 824 0=1.000000e-01
Convolution      Conv_324                 1 1 824 1036 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_325            1 1 1036 827 0=1.000000e-01
ConvolutionDepthWise Conv_326                 1 1 827 1039 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_327            1 1 1039 830 0=1.000000e-01
Convolution      Conv_328                 1 1 830 1042 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_329            1 1 1042 833 0=1.000000e-01
Convolution      Conv_330                 1 1 833 834 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3168
Slice            Split_331                1 2 834 835 836 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_332              1 1 835 837
Reshape          Reshape_334              1 1 837 839 0=-1 1=1
Permute          Transpose_335            1 1 839 cls_pred_stride_32 0=1
Reshape          Reshape_337              1 1 836 842 0=-1 1=32
Permute          Transpose_338            1 1 842 dis_pred_stride_32 0=1
